---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsWarning
source: html/91b18d1e-0df7-c438-2a0b-54c97c55524e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsWarning Property

This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId DistanceBetweenBarsWarning { get; }
```